mfa-backend/app/controllers/actions_controller.rb

SELECT "actions".* FROM "actions"
---
    def index
        actions = Action.all

INSERT INTO "actions" ("title", "action_type", "url", "created_at", "updated_at", "incident_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["action_type", "Vote"], ["url", "test"], ["created_at", "2020-06-18 20:31:19.498253"], ["updated_at", "2020-06-18 20:31:19.498253"], ["incident_id", 52]]
---
    def create
        action = Action.new(action_params)
            if action.save