mfa-backend/app/controllers/incidents_controller.rb

    def index
        incidents = Incident.all
---
SELECT "incidents".* FROM "incidents"

    def incidents_tweets
        incident = Incident.find_by(id: params[:id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]

    def create
        print incident_params
        incident = Incident.new(incident_params)
            if incident.save
---
INSERT INTO "incidents" ("title", "description", "image_url", "created_at", "updated_at", "lat", "lng", "organization", "petition") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def approved
        print params
        incident = Incident.find_by(id: params[:id])
        incident.update(approve: incident.approve + 1)
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "incidents" SET "approve" = $1, "updated_at" = $2 WHERE "incidents"."id" = $3  [["approve", 1], ["updated_at", "2020-06-20 00:20:36.480545"], ["id", 63]]