mfa-backend/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
    def index
        tweets = Tweet.all

INSERT INTO "tweets" ("url", "created_at", "updated_at", "incident_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "https://www.google.com/"], ["created_at", "2020-06-18 23:51:50.011459"], ["updated_at", "2020-06-18 23:51:50.011459"], ["incident_id", 52]]
---
    def create
        tweet = Tweet.new(tweet_params)
            if tweet.save